In [1]:
import pandas as pd

In [2]:
#Series
Marks = [99 , 98 , 97]
subject = ['english','chemistry','physics']
pd.Series(Marks , index=subject)

english      99
chemistry    98
physics      97
dtype: int64

In [3]:
#Create series from dictionary
x = pd.Series(
    {'a' : 1 ,
      'b' :2 ,
      'c' :3
      })

In [4]:
x = pd.Series({'a' : 1 , 'b' :2 ,'c' :3})
y = pd.Series({'a' : 4 , 'b' :5 ,'c' :6})

df = pd.DataFrame({
    'one' : x  ,
    'two'  : y ,
    'three' : {'a' : 7 , 'b' :8 ,'c' :9 } ,
    'fourth' : {'a' : 10 , 'b' :11 ,'c' :12} ,    
})

In [5]:
df

   one  two  three  fourth
a    1    4      7      10
b    2    5      8      11
c    3    6      9      12

In [6]:
df.rename(columns={'one' : 'One'})

   One  two  three  fourth
a    1    4      7      10
b    2    5      8      11
c    3    6      9      12

In [7]:
df[['one' , 'two']]

   one  two
a    1    4
b    2    5
c    3    6

In [8]:
df.columns

Index(['one', 'two', 'three', 'fourth'], dtype='object')

In [9]:
df.values

array([[ 1,  4,  7, 10],
       [ 2,  5,  8, 11],
       [ 3,  6,  9, 12]], dtype=int64)

In [10]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [11]:
df.iloc[0 : 1]

   one  two  three  fourth
a    1    4      7      10

In [12]:
df.iloc[[ 0 , 1]]

   one  two  three  fourth
a    1    4      7      10
b    2    5      8      11

In [13]:
df.loc['a' : 'b']

   one  two  three  fourth
a    1    4      7      10
b    2    5      8      11

In [14]:
df.loc['a' : 'b'  , 'one':'two']

   one  two
a    1    4
b    2    5

In [15]:
df.loc['a' :'b', :'three']

   one  two  three
a    1    4      7
b    2    5      8

In [16]:
df['three'] == 7

a     True
b    False
c    False
Name: three, dtype: bool

In [17]:
df.sort_values(by='fourth' , ascending=True)

   one  two  three  fourth
a    1    4      7      10
b    2    5      8      11
c    3    6      9      12

In [18]:
df.drop(columns='one')

   two  three  fourth
a    4      7      10
b    5      8      11
c    6      9      12

In [19]:
## Missing vlaue
x = pd.Series({'a' : None , 'b' :2 ,'c' :3})
y = pd.Series({'a' : 4 , 'b' :5 ,'c' :6})

df = pd.DataFrame({
    'one' : x  ,
    'two'  : y ,
    'three' : {'a' : 7 , 'b' :None ,'c' :9 } ,
    'fourth' : {'a' : 'Ali', 'b' :'ali' ,'c' :'Ahmed'} , 
    
})

In [20]:
df

   one  two  three fourth
a  NaN    4    7.0    Ali
b  2.0    5    NaN    ali
c  3.0    6    9.0  Ahmed

In [21]:
# handle missing vlaues
df.isnull().sum()

one       1
two       0
three     1
fourth    0
dtype: int64

In [22]:
df.dropna(axis='index' , how='any')

   one  two  three fourth
c  3.0    6    9.0  Ahmed

In [23]:
df

   one  two  three fourth
a  NaN    4    7.0    Ali
b  2.0    5    NaN    ali
c  3.0    6    9.0  Ahmed

In [24]:
df['one'].fillna(df['one'].mean() , inplace=True)
df['three'].fillna(df['three'].mean() , inplace=True)
df

   one  two  three fourth
a  2.5    4    7.0    Ali
b  2.0    5    8.0    ali
c  3.0    6    9.0  Ahmed

In [25]:
df.dtypes

one       float64
two         int64
three     float64
fourth     object
dtype: object

In [26]:
df['one'] = df['one'].astype(int)
df['three'] = df['three'].astype(int)

In [27]:
df.dtypes

one        int32
two        int64
three      int32
fourth    object
dtype: object

In [28]:
df['fourth'].replace('ali' , 'Eslam' , inplace=True)
df

   one  two  three fourth
a    2    4      7    Ali
b    2    5      8  Eslam
c    3    6      9  Ahmed

In [29]:
# list of Tuples 
s = [
    ('jack' , 34 ,'sydeny' ),
    ('rit' , 30 , 'New york') ,
    ('eslam' ,40 , 'Egypt') ,
    ('eslam' ,50 , 'Egypt') ,
    ('eslam' ,50 , 'Egypt') ,
    ('eslam' ,60 , 'Arab') ,
     ('Osam' ,30 , 'New york') 
    
    ] 
df = pd.DataFrame(s , columns=['Name' ,'Age' ,'City'])
df

    Name  Age      City
0   jack   34    sydeny
1    rit   30  New york
2  eslam   40     Egypt
3  eslam   50     Egypt
4  eslam   50     Egypt
5  eslam   60      Arab
6   Osam   30  New york

In [30]:
df.duplicated().sum()

1

In [31]:
df[df.duplicated()]

    Name  Age   City
4  eslam   50  Egypt

In [32]:
df_1 =df.drop_duplicates()
df_1

    Name  Age      City
0   jack   34    sydeny
1    rit   30  New york
2  eslam   40     Egypt
3  eslam   50     Egypt
5  eslam   60      Arab
6   Osam   30  New york

In [33]:
df_2 = df.drop_duplicates(ignore_index=True)
df_2

    Name  Age      City
0   jack   34    sydeny
1    rit   30  New york
2  eslam   40     Egypt
3  eslam   50     Egypt
4  eslam   60      Arab
5   Osam   30  New york

In [34]:
df_3 = df.drop_duplicates(subset=['Name'] ,ignore_index=True ,keep='first')
df_3

    Name  Age      City
0   jack   34    sydeny
1    rit   30  New york
2  eslam   40     Egypt
3   Osam   30  New york

In [35]:
df_4 = df.drop_duplicates(subset=['Name'] ,ignore_index=True ,keep='last')
df_4

    Name  Age      City
0   jack   34    sydeny
1    rit   30  New york
2  eslam   60      Arab
3   Osam   30  New york